#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary><strong>Validation Output</strong></summary>

```<br />
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary><strong>Show Plan</strong></summary>

``` <br />
terraform
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mYWY1NzQxNS1mMTNiLTQ3MzAtYjlhMi00ZGZmYWQxOTM2ODc7b2JqZWN0SWQ9YTcyNTdlM2ItMWFiMC00M2QyLWFiMjQtMTExZWUzN2NhN2Q2O3N1YnNjcmlwdGlvbklkPWY5MGI0MTIxLTU3ZjEtNGRiNi1hZGU2LTNiMTJlYTkzMGE2Njt0ZW5hbnRJZD1lOTk0MDcyYi01MjNlLTRiZmUtODZlMi00NDJjNWUxMGIyNDQ=]
module.rg.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto]
module.mongo_db.random_integer.ri: Refreshing state... [id=59303]
module.pubip.azurerm_public_ip.pubip: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/publicIPAddresses/pubip-twitter-auto]
module.nsg.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.cr.azurerm_container_registry.cr: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerRegistry/registries/crTwitterAuto]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto]
module.sa.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Storage/storageAccounts/mysonarqubestorage]
module.mongo_db.azurerm_cosmosdb_account.db: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.DocumentDB/databaseAccounts/tfex-cosmos-db-59303]
module.aks.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto]
module.snet.azurerm_subnet.snet: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/virtualNetworks/vnet-twitter-auto/subnets/snet-twitter-auto]
module.ni.azurerm_network_interface.ni: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto]
module.nisga.azurerm_network_interface_security_group_association.nisga: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkInterfaces/ni-twitter-auto|/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.Network/networkSecurityGroups/nsg-twitter-auto]
module.ss.azurerm_storage_share.ss: Refreshing state... [id=https://mysonarqubestorage.file.core.windows.net/mysonarqubedata]
module.cg.azurerm_container_group.cg: Refreshing state... [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerInstance/containerGroups/mysonarcube]
data.azurerm_kubernetes_cluster.cluster: Reading...
data.azurerm_kubernetes_cluster.cluster: Read complete after 1s [id=/subscriptions/f90b4121-57f1-4db6-ade6-3b12ea930a66/resourceGroups/rg-twitter-auto/providers/Microsoft.ContainerService/managedClusters/aks-twitter-auto]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.kube-prometheus will be created
  + resource "helm_release" "kube-prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stackr"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "36.2.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.monitoring will be created
  + resource "kubernetes_namespace" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cuatrosr, Action: `pull_request`, Workflow: `On Pull Request`*